Ran Plan for 4 projects:

1. dir: `SQS/SQS-3D-File` workspace: `default`
1. dir: `SQS/SQS-Document` workspace: `default`
1. dir: `SQS/SQS-Picture` workspace: `default`
1. dir: `SQS/SQS-Video` workspace: `default`
---

### 1. dir: `SQS/SQS-3D-File` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_sqs_queue.sqs_3d_file will be created
+ resource "aws_sqs_queue" "sqs_3d_file" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "sqs-3d-file"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/sqs/sqs-3d-file"
          + "environment" = "development"
          + "name"        = "sqs-3d-file"
        }
      + tags_all                          = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/sqs/sqs-3d-file"
          + "environment" = "development"
          + "name"        = "sqs-3d-file"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ sqs_queue_arn  = (known after apply)
+ sqs_queue_name = "sqs-3d-file"
+ sqs_queue_url  = (known after apply)
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `SQS/SQS-Document` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #8. To continue, delete the lock from #8 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 3. dir: `SQS/SQS-Picture` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #8. To continue, delete the lock from #8 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 4. dir: `SQS/SQS-Video` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #8. To continue, delete the lock from #8 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### Plan Summary

4 projects, 1 with changes, 0 with no changes, 3 failed